{
  "fullName": "Asadullah Shaikh",
  "title": "Associate System Engineer",
  "email": "sasadullah002@gmail.com",
  "phone": "8669003013",
  "location": "Pune",
  "profiles": [],
  "summary": "A recent graduate with a strong foundation in data analysis and software development seeking an Associate System Engineer position. Proficient in Java, Python, SQL, and C++, with experience in full-stack development and building data-driven solutions.  Eager to leverage technical skills in designing, developing, and maintaining technology solutions for business transformation.",
  "skills": [],
  "sections": [
    {
      "id": "gtguegv",
      "type": "projects",
      "title": "Projects",
      "items": [
        {
          "bullets": [
            "Developed \"Club Connect,\" a full-stack platform enabling college students to explore, join, and engage with campus clubs and events.  Utilized data analysis to identify trends in user engagement and club popularity.",
            "Designed and implemented an intuitive user interface (HTML, CSS, JavaScript) enhancing user experience and ease of navigation.",
            "Developed backend features (Node.js, Express, MongoDB) to manage club profiles, event registrations, and member interactions, ensuring efficient data management and secure access."
          ],
          "name": "Club-Connect",
          "link": null,
          "summary": "A full-stack platform demonstrating skills in data analysis, UI/UX design, and backend development, showcasing capabilities applicable to designing and implementing software applications and IT solutions."
        },
        {
          "bullets": [
            "Developed a full-stack fitness platform managing user registration, class booking, and trainer profiles.  Incorporated data analysis to track user activity and optimize platform features.",
            "Implemented secure authentication and role-based access control (JWT) for users, trainers, and admins, ensuring data security and privacy.",
            "Built a responsive frontend (HTML, CSS, JavaScript) ensuring cross-platform compatibility and a seamless user experience."
          ],
          "name": "Go-Fit App",
          "link": null,
          "summary": "A full-stack fitness platform demonstrating experience in secure development, data management, and responsive design, highlighting skills transferable to supporting system integration and maintenance."
        }
      ]
    },
    {
      "id": "hg4pezw",
      "type": "education",
      "title": "Education",
      "items": [
        {
          "school": "Savitribai Phule Pune University",
          "degree": "Bachelor’s of Computer Application",
          "field": "Computer Applications",
          "start": "Apr 2021",
          "end": "Apr 2024",
          "location": "Pune",
          "score": null
        },
        {
          "school": "Crescent High School & Junior College",
          "degree": "Matriculation",
          "field": null,
          "start": "Apr 2018",
          "end": "Apr 2019",
          "location": "Pune",
          "score": "69.20"
        },
        {
          "school": "Poona college of art science and commerce",
          "degree": "Intermediate",
          "field": "Intermediate",
          "start": "Apr 2019",
          "end": "Apr 2021",
          "location": "Pune",
          "score": "82"
        }
      ]
    },
    {
      "id": "mn3kejy",
      "type": "skillsets",
      "title": "Skills",
      "items": [
        {
          "languages": [
            "Java",
            "Python",
            "SQL",
            "C++"
          ],
          "soft": [
            "Communication",
            "Problem-Solving",
            "Time Management",
            "Collaboration"
          ],
          "concepts": [
            "Statistics & Probability",
            "OOP",
            "ML"
          ],
          "tools": [
            "Power BI",
            "Tableau",
            "Excel"
          ],
          "platforms": [
            "AWS",
            "Azure",
            "Linux"
          ]
        }
      ]
    }
  ],
  "meta": {
    "fileName": "Asad Resume.pdf",
    "uploadDate": "2025-09-17T21:20:20.095128"
  }
}